---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.IsBoughtOut
source: html/b1770d17-b9c5-4384-4c57-fa4cf1f3cbd6.htm
---
# Autodesk.Revit.DB.FabricationPart.IsBoughtOut Property

True if the fabrication part is bought out.

## Syntax (C#)
```csharp
public bool IsBoughtOut { get; }
```